{"type_of":"article","id":1246960,"title":"What is the cloud? Beginner's guide to cloud computing concepts","description":"In the last few years, cloud computing has become the new norm for most industries around the world....","readable_publish_date":"Nov 7","slug":"what-is-the-cloud-beginners-guide-to-cloud-computing-concepts-3eb5","path":"/educative/what-is-the-cloud-beginners-guide-to-cloud-computing-concepts-3eb5","url":"https://dev.to/educative/what-is-the-cloud-beginners-guide-to-cloud-computing-concepts-3eb5","comments_count":0,"public_reactions_count":0,"collection_id":null,"published_timestamp":"2022-11-07T19:00:21Z","positive_reactions_count":0,"cover_image":"https://res.cloudinary.com/practicaldev/image/fetch/s--kWv7lMRe--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ajqxjxwtr4txpacjdb0q.jpg","social_image":"https://res.cloudinary.com/practicaldev/image/fetch/s--t7g3IVOn--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ajqxjxwtr4txpacjdb0q.jpg","canonical_url":"https://www.educative.io/blog/beginners-guide-cloud-computation","created_at":"2022-11-07T19:00:21Z","edited_at":null,"crossposted_at":null,"published_at":"2022-11-07T19:00:21Z","last_comment_at":"2022-11-07T19:00:21Z","reading_time_minutes":9,"tag_list":"cloud, aws, beginners, codenewbie","tags":["cloud","aws","beginners","codenewbie"],"body_html":"<p>In the last few years, cloud computing has become the new norm for most industries around the world. Being a developing topic, there are a lot of terms surrounding cloud computing you may have never heard before.</p>\n\n<p>Whether you're a manager of a cloud development team or an aspiring cloud architect, we'll walk you through all the terms and background you'll need to understand the new and exciting cloud. </p>\n\n<p><strong>Here's what we'll learn today:</strong></p>\n\n<ul>\n<li><a href=\"#what-is\">What is Cloud Computing?</a></li>\n<li><a href=\"#tradeoffs\">Advantages and Disadvantages of Cloud Computing</a></li>\n<li><a href=\"#services\">What are Services?</a></li>\n<li><a href=\"#private\">Public vs. Private Cloud</a></li>\n<li><a href=\"#providers\">Cloud Providers</a></li>\n<li><a href=\"#migration\">What is Cloud Migration?</a></li>\n<li><a href=\"#intermediate\">Intermediate Terms</a></li>\n<li>\n<a href=\"#wrap-up\">Wrapping Up and Next Steps</a> </li>\n</ul>\n\n<p><a name=\"what-is\"></a></p>\n\n<h2>\n  <a name=\"what-is-cloud-computing\" href=\"#what-is-cloud-computing\">\n  </a>\n  What is Cloud Computing?\n</h2>\n\n<p><a href=\"https://res.cloudinary.com/practicaldev/image/fetch/s--xEM5pmuL--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ox6smvn52wbv0jsnyfm2.png\" class=\"article-body-image-wrapper\"><img src=\"https://res.cloudinary.com/practicaldev/image/fetch/s--xEM5pmuL--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ox6smvn52wbv0jsnyfm2.png\" alt=\"Before cloud computing\" loading=\"lazy\" width=\"880\" height=\"413\"></a></p>\n\n<h3>\n  <a name=\"before-cloud-computing\" href=\"#before-cloud-computing\">\n  </a>\n  Before Cloud Computing\n</h3>\n\n<p>Let's start at the beginning.</p>\n\n<p>Before cloud computing, companies had to buy their own servers to install and manage inside their buildings. This setup is known as on-premises storage.</p>\n\n<p>On-premises storage has many downsides, such as high up-front cost, information being only accessible from a select area, and a high risk of loss should the server lose power.</p>\n\n<p>Between companies, too, on-premises storage hurt business by making it difficult for companies to share information.</p>\n\n<p>These problems seemed unavoidable, that is, until the advent of cloud computing.</p>\n\n<h3>\n  <a name=\"the-era-of-cloud-computing\" href=\"#the-era-of-cloud-computing\">\n  </a>\n  The Era of Cloud Computing\n</h3>\n\n<p>Cloud computing is a system that allows access to services like storage or development platforms on-demand via internet-connected off-site data centers.</p>\n\n<p>These data centers are managed by third-party companies, referred to as cloud providers.</p>\n\n<p>This system not only addresses all the problems which plagued the on-premises systems, but they're also usually cheaper, more scalable, and more convenient.</p>\n\n<p><a href=\"https://www.educative.io/blog/amazon-aws-best-services?eid=5082902844932096\">Amazon AWS</a> was the first major cloud computing service provider, being released in 2006. AWS currently has about half the cloud services market share but has now gained notable opposition in Microsoft with Azure and Google with the Google Cloud. </p>\n\n<blockquote>\n<p><strong>Where is cloud storage?</strong><br>\n<a href=\"https://www.educative.io/answers/what-is-cloud-storage?eid=5082902844932096\">Cloud storage</a> sounds like it's just floating somewhere when really, it's very similar to traditional hardware storage.</p>\n\n<p>Saving something to the cloud sends it to be stored in a local data center operated by the cloud host business (Google, Amazon, etc.). These data centers are, in fact, very similar to old-fashioned corporate server rooms, but instead of each company having to fund and operate their own server room, now they can outsource their storage to these centralized cloud data centers.</p>\n\n<p>Each cloud storage provider has hundreds of these data centers all across the planet, ensuring you can access your work from anywhere, on any device.</p>\n</blockquote>\n\n<p><a name=\"tradeoffs\"></a></p>\n\n<h2>\n  <a name=\"advantages-and-disadvantages-of-cloud-computing\" href=\"#advantages-and-disadvantages-of-cloud-computing\">\n  </a>\n  Advantages and Disadvantages of Cloud Computing\n</h2>\n\n<p>While solving all the problems of on-premises-based systems, cloud computing has its own share of disadvantages.</p>\n\n<p>Let's break down the advantages and disadvantages of cloud computing when considering migration to the cloud.</p>\n\n<h3>\n  <a name=\"advantages-of-cloud-computing\" href=\"#advantages-of-cloud-computing\">\n  </a>\n  Advantages of Cloud Computing:\n</h3>\n\n<p><strong>Democratizes access to technology</strong></p>\n\n<p>Companies, both small and large, can access similar high-tech services. By switching from high up-front hardware to dynamically priced and well-established data centers, it's easier than ever for even fresh companies to have the best tools.</p>\n\n<p><strong>Focus on product, not infrastructure</strong> </p>\n\n<p>Businesses can increase efficiency and reduce costs by focusing on what they do best, making their product, and leaving the computing administration to the provider. </p>\n\n<p><strong>Easier maintenance</strong></p>\n\n<p>Thanks to the centralized data centers, updates and maintenance can be distributed company-wide in just a single click.</p>\n\n<p><strong>Versatility</strong> </p>\n\n<p>Hosting computer resources on the cloud breaks dependency on the office, allowing developers to work from home or any location with a solid Internet connection.</p>\n\n<p><strong>Reliable</strong> </p>\n\n<p>Cloud providers have the scale to invest in advanced security measures and backups on-premises systems couldn't achieve. Also, by virtue of being off-site, a company's data is safe, even in the case of a power outage or other system failure.</p>\n\n<h3>\n  <a name=\"disadvantages-of-cloud-computing\" href=\"#disadvantages-of-cloud-computing\">\n  </a>\n  Disadvantages of Cloud Computing:\n</h3>\n\n<p><strong>Network Dependent</strong></p>\n\n<p>If all of your company's files and applications are stored on the cloud, you simply cannot work without an internet connection.</p>\n\n<p>If a service outage occurs, employees can be stuck and unable to work, costing thousands in production loss.</p>\n\n<p><strong>Loss of Control</strong></p>\n\n<p>Regardless of the chosen service type, all cloud systems involve giving up some control of data or storage. While this reduces the load on the client company, it can be a stressful switch to no longer have full control. This requires a trust that the cloud provider will protect your data and production with the same care that you would in house.</p>\n\n<p><strong>Less Control over Maintenance</strong></p>\n\n<p>Especially with PaaS and SaaS, clients have nearly no ability to speed along or perform maintenance on their end. This means if there is a problem with a cloud service the only thing to do is call the cloud provider's support team.</p>\n\n<p>These support teams have gracious open periods but they're not 24-hour, meaning sometimes you may not be able to get your problem solved until the following morning. Their aid is excellent, however for some leaders that disconnect is too great to be convenient.</p>\n\n<p><strong>More Appealing Hack Targets</strong><br>\nData centers are appealing targets for hacking attacks because of the sheer amount of data they contain. For smaller cloud clients, lumping their data together increases the number of attacks that would target their data than if it was stored in a less appealing on-premises system.</p>\n\n<p>It's a constant battle for cloud cyber-security developers to hold off breach attempts, and inevitably one will eventually get through. </p>\n\n<p><a name=\"services\"></a></p>\n\n<h2>\n  <a name=\"what-are-services-in-cloud-computing\" href=\"#what-are-services-in-cloud-computing\">\n  </a>\n  What are services in Cloud Computing?\n</h2>\n\n<p><a href=\"https://res.cloudinary.com/practicaldev/image/fetch/s--Fs9zZpkj--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rjr17ckgzj9pubwigik6.png\" class=\"article-body-image-wrapper\"><img src=\"https://res.cloudinary.com/practicaldev/image/fetch/s--Fs9zZpkj--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rjr17ckgzj9pubwigik6.png\" alt=\"Cloud services\" loading=\"lazy\" width=\"681\" height=\"213\"></a></p>\n\n<p>Services can be thought of as individual cloud capabilities provided to companies. For example, cloud storage would be a separate service from application hosting.</p>\n\n<p>These services are often bundled into packages of three types depending on how the cloud is used in a given business, with IaaS clients relying on the cloud less than SaaS clients. </p>\n\n<p>Let's look at what defines each and some examples you may be familiar with.</p>\n\n<blockquote>\n<p>Each service builds onto each other as we go down, SaaS includes all the features of PaaS and so on.</p>\n</blockquote>\n\n<h3>\n  <a name=\"infrastructure-as-a-service-iaas\" href=\"#infrastructure-as-a-service-iaas\">\n  </a>\n  Infrastructure as a Service (IaaS)\n</h3>\n\n<p>This is the least dependent of the cloud service types, meaning many capabilities (data, applications, runtime, O/S) are still handled internally. </p>\n\n<p>In this category, the company rents VMs, storage, network, and operating systems from the cloud provider on a pay-as-you-go basis.</p>\n\n<p>This saves the business from having invest in expensive on-premises hardware and leaves room for the company to grow via the flexible payment style. </p>\n\n<p><strong>Examples:</strong> </p>\n\n<ul>\n<li>Amazon EC2 and S3</li>\n<li>Google Compute Engine</li>\n<li>Windows Azure.</li>\n</ul>\n\n<h3>\n  <a name=\"platform-as-a-service-paas\" href=\"#platform-as-a-service-paas\">\n  </a>\n  Platform as a Service (PaaS)\n</h3>\n\n<p>This is the mid-point between control and ease which provides all middleware and environments to use when developing and running applications.</p>\n\n<p>These standardized environments help developers craft their applications to work seamlessly with web servers, database management systems, and software development kits for top programming languages.</p>\n\n<p><strong>Examples:</strong></p>\n\n<ul>\n<li>AWS Elastic Beanstalk</li>\n<li>Heroku</li>\n<li>Windows </li>\n<li>Azure</li>\n<li>Force</li>\n<li>Google App Engine</li>\n</ul>\n\n<h3>\n  <a name=\"software-as-a-service-saas\" href=\"#software-as-a-service-saas\">\n  </a>\n  Software as a Service (SaaS)\n</h3>\n\n<p>This service type leans most heavily towards ease of all three, with most computerized functions being handled off-site. </p>\n\n<p>PaaS allows businesses to host and run their applications on cloud data centers rather than private servers. In doing so, users can access applications through the internet in real-time without needing to download and install the app locally. It also includes security, dev support, and maintenance handled by the cloud provider as part of the cost.</p>\n\n<p>This service allows developers to create responsive applications for use on-demand on any device.</p>\n\n<p><strong>Examples:</strong> </p>\n\n<ul>\n<li>Dropbox</li>\n<li>Google Apps</li>\n<li>Microsoft Office 365</li>\n<li>Gmail</li>\n<li>Yahoo</li>\n<li>Facebook</li>\n</ul>\n\n<p><a name=\"private\"></a></p>\n\n<h2>\n  <a name=\"public-vs-private-cloud\" href=\"#public-vs-private-cloud\">\n  </a>\n  Public vs. Private Cloud\n</h2>\n\n<p>Up until now, we've only discussed <strong>public cloud</strong> in which data centers can contain data for hundreds of different users or clients. These clients only need to pay for the storage they use, rather than paying for the ability to use the data center. </p>\n\n<p>The majority of cloud use is done on public cloud services.</p>\n\n<ul>\n<li>\n<strong>Pros:</strong> fits the needs of most organizations and lower upfront costs</li>\n<li>\n<strong>Cons:</strong> can be less-cost effective for large companies, target for hackers, more users means more avenues to a breach</li>\n</ul>\n\n<p>Companies can also pay to reserve a data center so that it is used only by that company, called a <strong>Private Cloud</strong>. This is often used by companies which store sensitive data such as banks or hospitals as they're more secure.</p>\n\n<ul>\n<li>\n<strong>Pros:</strong> more control over data, lower security risk, adaptable to needs and size</li>\n<li>\n<strong>Cons:</strong> Expensive up-front costs</li>\n</ul>\n\n<p><a name=\"providers\"></a></p>\n\n<h2>\n  <a name=\"cloud-service-providers\" href=\"#cloud-service-providers\">\n  </a>\n  Cloud Service Providers\n</h2>\n\n<p>While Amazon is the most well-known, the cloud computing market is still developing. Many tech companies have created their own cloud software with different strengths and specialties.</p>\n\n<p>Let's look at which software is good for each job.</p>\n\n<p><strong>The Big Three of Public Cloud:</strong></p>\n\n<ul>\n<li>AWS</li>\n<li>Microsoft Azure</li>\n<li>Google Cloud</li>\n</ul>\n\n<p><strong>Infrastructure-as-a-Service:</strong></p>\n\n<ul>\n<li>AWS</li>\n<li>Microsoft Azure</li>\n<li>Google Cloud</li>\n</ul>\n\n<p><strong>Multi-Cloud Hybrid Deployments:</strong></p>\n\n<ul>\n<li>IBM</li>\n<li>Dell</li>\n<li>HP</li>\n<li>VMWare</li>\n</ul>\n\n<p><strong>Software-as-a-Service:</strong></p>\n\n<ul>\n<li>Salesforce</li>\n<li>Adobe</li>\n<li>Workday</li>\n<li>Oracle </li>\n</ul>\n\n<p><a name=\"migration\"></a></p>\n\n<h2>\n  <a name=\"what-is-cloud-migration\" href=\"#what-is-cloud-migration\">\n  </a>\n  What is Cloud Migration?\n</h2>\n\n<p>Cloud migration is the process of moving a company's data, applications, and business infrastructure into a cloud environment. This migration is notoriously tricky, and many companies don't migrate simply because of the work. But the overall benefits far outweigh the challenges. </p>\n\n<h3>\n  <a name=\"types-of-cloud-migration\" href=\"#types-of-cloud-migration\">\n  </a>\n  Types of Cloud Migration\n</h3>\n\n<p>There are many kinds of cloud migration that a company can consider based on their factors, such as cost, security, and performance. The most common is to transfer on-premises data centers to a public cloud.</p>\n\n<p>Another avenue is moving data to a new vendor or private cloud, called <strong>cloud-to-cloud migration</strong>. </p>\n\n<p>Cloud migration requires you to evaluate your requirements, select a vendor, calculate all costs, and reorganize the company. </p>\n\n<h3>\n  <a name=\"crafting-a-migration-strategy\" href=\"#crafting-a-migration-strategy\">\n  </a>\n  Crafting a Migration Strategy\n</h3>\n\n<p>Migrating to the cloud requires strategy because of the scale of the change. </p>\n\n<p>There are some common things considered when crafting a cloud migration strategy:</p>\n\n<ul>\n<li>What current technologies and infrastructure does the company have? Will they be able to reuse any of it?</li>\n<li>What type of services does the company need? Would IaaS, PaaS, or SaaS be best?</li>\n<li>How does the company/team want to scale or grow?</li>\n<li>Will anyone's jobs be changing now that we are migrating? </li>\n</ul>\n\n<p><a name=\"intermediate\"></a></p>\n\n<h2>\n  <a name=\"intermediate-cloud-computing-terms\" href=\"#intermediate-cloud-computing-terms\">\n  </a>\n  Intermediate Cloud Computing Terms\n</h2>\n\n<p>Now that we've learned some basic terms and concepts, lets take a look at a few of the more intermediate words that are a staple of many in-office discussions.</p>\n\n<h3>\n  <a name=\"workloads\" href=\"#workloads\">\n  </a>\n  Workloads\n</h3>\n\n<p>A workload is a business process, like accounting, paying the company’s bills, or marketing releasing a branding update. Workloads are how developers think about business requirements, a phrase you might hear is <strong>migrating workloads to the cloud.</strong></p>\n\n<p>Migrating workloads to the cloud means moving all the required pieces of a business process to cloud computing services.</p>\n\n<h3>\n  <a name=\"cloudnative\" href=\"#cloudnative\">\n  </a>\n  Cloud-Native\n</h3>\n\n<p>Cloud-native means using cloud tools to develop software from the beginning of the development cycle.<br>\nCloud-native development is grounded in containers, microservices, and dynamic orchestration. These applications are a collection of independent, loosely coupled services, and they are optimized for continuous integration and continuous deployment (CI/CD). </p>\n\n<p>Cloud-native is very powerful because they are much easier to make and far more integrated than the traditional development model. Cloud-native development gives access to many developer tools. For example, some tools make it easier to use open-source software packages or deploy a web application.  </p>\n\n<h3>\n  <a name=\"containers\" href=\"#containers\">\n  </a>\n  Containers\n</h3>\n\n<p>A <a href=\"https://www.educative.io/edpresso/intro-to-docker---containers-images-and-the-dockerfile?eid=5082902844932096\">container</a> is a standardized unit of software. Containers package code and dependencies into a lightweight, standalone executable that contains everything required to run the application, regardless of the infrastructure. These allow developers to deploy applications in multiple clouds without worrying about the cloud service provider. </p>\n\n<p><a name=\"wrap-up\"></a></p>\n\n<h2>\n  <a name=\"wrapping-up\" href=\"#wrapping-up\">\n  </a>\n  Wrapping up\n</h2>\n\n<p>You've just completed your first step into the ever-changing world of cloud computing. You've built a strong foundation which will allow you to not only speak confidently about the cloud but also to jump hands-on into cloud programming.</p>\n\n<h2>\n  <a name=\"next-steps\" href=\"#next-steps\">\n  </a>\n  Next Steps\n</h2>\n\n<p>For aspiring cloud developers, your next step is to move to learning intermediate cloud architecture like:</p>\n\n<ul>\n<li>Microservices Deployment</li>\n<li>Block Storage</li>\n<li>Cloud Instances</li>\n<li>Autoscaling</li>\n<li>Container Orchestration</li>\n</ul>\n\n<p>To help you take that step, Educative has teamed up with veteran full-stack developer Shivang Sarawagi to create an interactive, comprehensive course, <a href=\"https://www.educative.io/courses/cloud-computing-101-master-the-fundamentals?eid=5082902844932096\"><strong>Cloud Computing 101: Master the Fundamentals</strong></a>, sure to accelerate your cloud learning. </p>\n\n<p>Once you've learned these fundamentals, you can learning a cloud platform of your choice, be it <a href=\"https://www.educative.io/blog/amazon-aws-best-services?eid=5082902844932096\">AWS</a>, <a href=\"https://www.educative.io/blog/how-to-deploy-your-machine-learning-model?eid=5082902844932096\">Azure</a>, or Google Cloud Platform.</p>\n\n<p>With these resources in hand, you're well on your way to that dream cloud development position.</p>\n\n<p><em>Happy learning!</em></p>\n\n<h3>\n  <a name=\"continue-learning-about-cloud-computing-on-educative\" href=\"#continue-learning-about-cloud-computing-on-educative\">\n  </a>\n  Continue learning about cloud computing on Educative\n</h3>\n\n<ul>\n<li><a href=\"https://www.educative.io/blog/cloud-native-interview?eid=5082902844932096\">What is cloud-native? What to know for your interview</a></li>\n<li><a href=\"https://www.educative.io/blog/crack-aws-certification-exam?eid=5082902844932096\">Cracking the AWS certification exams: How to prepare</a></li>\n<li><a href=\"https://www.educative.io/blog/top-five-aws-courses?eid=5082902844932096\">5 AWS courses to help take your skills to the next level</a></li>\n</ul>\n\n<h3>\n  <a name=\"start-a-discussion\" href=\"#start-a-discussion\">\n  </a>\n  Start a discussion\n</h3>\n\n<p>What is your favorite benefit of cloud computing? Was this article helpful? Let us know in the comments below! </p>\n\n","body_markdown":"In the last few years, cloud computing has become the new norm for most industries around the world. Being a developing topic, there are a lot of terms surrounding cloud computing you may have never heard before.\n\nWhether you're a manager of a cloud development team or an aspiring cloud architect, we'll walk you through all the terms and background you'll need to understand the new and exciting cloud. \n\n**Here's what we'll learn today:**\n* [What is Cloud Computing?](#what-is)\n* [Advantages and Disadvantages of Cloud Computing](#tradeoffs)\n* [What are Services?](#services)\n* [Public vs. Private Cloud](#private)\n* [Cloud Providers](#providers)\n* [What is Cloud Migration?](#migration)\n* [Intermediate Terms](#intermediate)\n* [Wrapping Up and Next Steps](#wrap-up) \n\n<a name=\"what-is\"></a>\n\n## What is Cloud Computing?\n\n![Before cloud computing](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ox6smvn52wbv0jsnyfm2.png)\n\n### Before Cloud Computing\n\nLet's start at the beginning.\n \nBefore cloud computing, companies had to buy their own servers to install and manage inside their buildings. This setup is known as on-premises storage.\n\nOn-premises storage has many downsides, such as high up-front cost, information being only accessible from a select area, and a high risk of loss should the server lose power.\n\nBetween companies, too, on-premises storage hurt business by making it difficult for companies to share information.\n\nThese problems seemed unavoidable, that is, until the advent of cloud computing.\n\n### The Era of Cloud Computing\n\nCloud computing is a system that allows access to services like storage or development platforms on-demand via internet-connected off-site data centers.\n\nThese data centers are managed by third-party companies, referred to as cloud providers.\n\nThis system not only addresses all the problems which plagued the on-premises systems, but they're also usually cheaper, more scalable, and more convenient.\n\n[Amazon AWS](https://www.educative.io/blog/amazon-aws-best-services?eid=5082902844932096) was the first major cloud computing service provider, being released in 2006. AWS currently has about half the cloud services market share but has now gained notable opposition in Microsoft with Azure and Google with the Google Cloud. \n\n> **Where is cloud storage?**\n>[Cloud storage](https://www.educative.io/answers/what-is-cloud-storage?eid=5082902844932096) sounds like it's just floating somewhere when really, it's very similar to traditional hardware storage.\n>\n> Saving something to the cloud sends it to be stored in a local data center operated by the cloud host business (Google, Amazon, etc.). These data centers are, in fact, very similar to old-fashioned corporate server rooms, but instead of each company having to fund and operate their own server room, now they can outsource their storage to these centralized cloud data centers.\n>\n> Each cloud storage provider has hundreds of these data centers all across the planet, ensuring you can access your work from anywhere, on any device.\n\n<a name=\"tradeoffs\"></a>\n\n## Advantages and Disadvantages of Cloud Computing\n\nWhile solving all the problems of on-premises-based systems, cloud computing has its own share of disadvantages.\n\nLet's break down the advantages and disadvantages of cloud computing when considering migration to the cloud.\n\n### Advantages of Cloud Computing:\n\n**Democratizes access to technology**\n\nCompanies, both small and large, can access similar high-tech services. By switching from high up-front hardware to dynamically priced and well-established data centers, it's easier than ever for even fresh companies to have the best tools.\n\n**Focus on product, not infrastructure** \n\nBusinesses can increase efficiency and reduce costs by focusing on what they do best, making their product, and leaving the computing administration to the provider. \n\n**Easier maintenance**\n\nThanks to the centralized data centers, updates and maintenance can be distributed company-wide in just a single click.\n\n**Versatility** \n\nHosting computer resources on the cloud breaks dependency on the office, allowing developers to work from home or any location with a solid Internet connection.\n\n**Reliable** \n\nCloud providers have the scale to invest in advanced security measures and backups on-premises systems couldn't achieve. Also, by virtue of being off-site, a company's data is safe, even in the case of a power outage or other system failure.\n\n### Disadvantages of Cloud Computing:\n\n**Network Dependent**\n\nIf all of your company's files and applications are stored on the cloud, you simply cannot work without an internet connection.\n\nIf a service outage occurs, employees can be stuck and unable to work, costing thousands in production loss.\n\n**Loss of Control**\n\nRegardless of the chosen service type, all cloud systems involve giving up some control of data or storage. While this reduces the load on the client company, it can be a stressful switch to no longer have full control. This requires a trust that the cloud provider will protect your data and production with the same care that you would in house.\n\n**Less Control over Maintenance**\n\nEspecially with PaaS and SaaS, clients have nearly no ability to speed along or perform maintenance on their end. This means if there is a problem with a cloud service the only thing to do is call the cloud provider's support team.\n\nThese support teams have gracious open periods but they're not 24-hour, meaning sometimes you may not be able to get your problem solved until the following morning. Their aid is excellent, however for some leaders that disconnect is too great to be convenient.\n\n**More Appealing Hack Targets**\nData centers are appealing targets for hacking attacks because of the sheer amount of data they contain. For smaller cloud clients, lumping their data together increases the number of attacks that would target their data than if it was stored in a less appealing on-premises system.\n\nIt's a constant battle for cloud cyber-security developers to hold off breach attempts, and inevitably one will eventually get through. \n\n<a name=\"services\"></a>\n\n## What are services in Cloud Computing?\n\n![Cloud services](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rjr17ckgzj9pubwigik6.png)\n\nServices can be thought of as individual cloud capabilities provided to companies. For example, cloud storage would be a separate service from application hosting.\n\nThese services are often bundled into packages of three types depending on how the cloud is used in a given business, with IaaS clients relying on the cloud less than SaaS clients. \n\nLet's look at what defines each and some examples you may be familiar with.\n\n>Each service builds onto each other as we go down, SaaS includes all the features of PaaS and so on.\n\n### Infrastructure as a Service (IaaS)\n\nThis is the least dependent of the cloud service types, meaning many capabilities (data, applications, runtime, O/S) are still handled internally. \n\nIn this category, the company rents VMs, storage, network, and operating systems from the cloud provider on a pay-as-you-go basis.\n\nThis saves the business from having invest in expensive on-premises hardware and leaves room for the company to grow via the flexible payment style. \n\n**Examples:** \n* Amazon EC2 and S3\n* Google Compute Engine\n* Windows Azure.\n\n### Platform as a Service (PaaS)\n\nThis is the mid-point between control and ease which provides all middleware and environments to use when developing and running applications.\n\nThese standardized environments help developers craft their applications to work seamlessly with web servers, database management systems, and software development kits for top programming languages.\n\n**Examples:**\n* AWS Elastic Beanstalk\n* Heroku\n* Windows \n* Azure\n* Force\n* Google App Engine\n\n### Software as a Service (SaaS)\n\nThis service type leans most heavily towards ease of all three, with most computerized functions being handled off-site. \n\nPaaS allows businesses to host and run their applications on cloud data centers rather than private servers. In doing so, users can access applications through the internet in real-time without needing to download and install the app locally. It also includes security, dev support, and maintenance handled by the cloud provider as part of the cost.\n\nThis service allows developers to create responsive applications for use on-demand on any device.\n\n**Examples:** \n* Dropbox\n* Google Apps\n* Microsoft Office 365\n* Gmail\n* Yahoo\n* Facebook\n\n<a name=\"private\"></a>\n\n## Public vs. Private Cloud\n\nUp until now, we've only discussed **public cloud** in which data centers can contain data for hundreds of different users or clients. These clients only need to pay for the storage they use, rather than paying for the ability to use the data center. \n\nThe majority of cloud use is done on public cloud services.\n\n* **Pros:** fits the needs of most organizations and lower upfront costs\n* **Cons:** can be less-cost effective for large companies, target for hackers, more users means more avenues to a breach\n\nCompanies can also pay to reserve a data center so that it is used only by that company, called a **Private Cloud**. This is often used by companies which store sensitive data such as banks or hospitals as they're more secure.\n\n* **Pros:** more control over data, lower security risk, adaptable to needs and size\n* **Cons:** Expensive up-front costs\n\n<a name=\"providers\"></a>\n\n## Cloud Service Providers\n\nWhile Amazon is the most well-known, the cloud computing market is still developing. Many tech companies have created their own cloud software with different strengths and specialties.\n\nLet's look at which software is good for each job.\n\n**The Big Three of Public Cloud:**\n* AWS\n* Microsoft Azure\n* Google Cloud\n\n**Infrastructure-as-a-Service:**\n* AWS\n* Microsoft Azure\n* Google Cloud\n\n**Multi-Cloud Hybrid Deployments:**\n* IBM\n* Dell\n* HP\n* VMWare\n\n**Software-as-a-Service:**\n* Salesforce\n* Adobe\n* Workday\n* Oracle \n\n<a name=\"migration\"></a>\n\n## What is Cloud Migration? \n\nCloud migration is the process of moving a company's data, applications, and business infrastructure into a cloud environment. This migration is notoriously tricky, and many companies don't migrate simply because of the work. But the overall benefits far outweigh the challenges. \n\n### Types of Cloud Migration\n\nThere are many kinds of cloud migration that a company can consider based on their factors, such as cost, security, and performance. The most common is to transfer on-premises data centers to a public cloud.\n\nAnother avenue is moving data to a new vendor or private cloud, called **cloud-to-cloud migration**. \n\nCloud migration requires you to evaluate your requirements, select a vendor, calculate all costs, and reorganize the company. \n\n### Crafting a Migration Strategy\n\nMigrating to the cloud requires strategy because of the scale of the change. \n\nThere are some common things considered when crafting a cloud migration strategy:\n\n* What current technologies and infrastructure does the company have? Will they be able to reuse any of it?\n* What type of services does the company need? Would IaaS, PaaS, or SaaS be best?\n* How does the company/team want to scale or grow?\n* Will anyone's jobs be changing now that we are migrating? \n\n<a name=\"intermediate\"></a>\n\n## Intermediate Cloud Computing Terms\n\nNow that we've learned some basic terms and concepts, lets take a look at a few of the more intermediate words that are a staple of many in-office discussions.\n\n### Workloads\n\nA workload is a business process, like accounting, paying the company’s bills, or marketing releasing a branding update. Workloads are how developers think about business requirements, a phrase you might hear is **migrating workloads to the cloud.**\n \nMigrating workloads to the cloud means moving all the required pieces of a business process to cloud computing services.\n\n### Cloud-Native \n\nCloud-native means using cloud tools to develop software from the beginning of the development cycle.\nCloud-native development is grounded in containers, microservices, and dynamic orchestration. These applications are a collection of independent, loosely coupled services, and they are optimized for continuous integration and continuous deployment (CI/CD). \n\nCloud-native is very powerful because they are much easier to make and far more integrated than the traditional development model. Cloud-native development gives access to many developer tools. For example, some tools make it easier to use open-source software packages or deploy a web application.  \n\n### Containers\n\nA [container](https://www.educative.io/edpresso/intro-to-docker---containers-images-and-the-dockerfile?eid=5082902844932096) is a standardized unit of software. Containers package code and dependencies into a lightweight, standalone executable that contains everything required to run the application, regardless of the infrastructure. These allow developers to deploy applications in multiple clouds without worrying about the cloud service provider. \n\n<a name=\"wrap-up\"></a>\n\n## Wrapping up\n\nYou've just completed your first step into the ever-changing world of cloud computing. You've built a strong foundation which will allow you to not only speak confidently about the cloud but also to jump hands-on into cloud programming.\n\n## Next Steps\n\nFor aspiring cloud developers, your next step is to move to learning intermediate cloud architecture like:\n* Microservices Deployment\n* Block Storage\n* Cloud Instances\n* Autoscaling\n* Container Orchestration\n\nTo help you take that step, Educative has teamed up with veteran full-stack developer Shivang Sarawagi to create an interactive, comprehensive course, [**Cloud Computing 101: Master the Fundamentals**](https://www.educative.io/courses/cloud-computing-101-master-the-fundamentals?eid=5082902844932096), sure to accelerate your cloud learning. \n\nOnce you've learned these fundamentals, you can learning a cloud platform of your choice, be it [AWS](https://www.educative.io/blog/amazon-aws-best-services?eid=5082902844932096), [Azure](https://www.educative.io/blog/how-to-deploy-your-machine-learning-model?eid=5082902844932096), or Google Cloud Platform.\n\nWith these resources in hand, you're well on your way to that dream cloud development position.\n\n*Happy learning!*\n\n### Continue learning about cloud computing on Educative\n* [What is cloud-native? What to know for your interview](https://www.educative.io/blog/cloud-native-interview?eid=5082902844932096)\n* [Cracking the AWS certification exams: How to prepare](https://www.educative.io/blog/crack-aws-certification-exam?eid=5082902844932096)\n* [5 AWS courses to help take your skills to the next level](https://www.educative.io/blog/top-five-aws-courses?eid=5082902844932096)\n\n### Start a discussion \nWhat is your favorite benefit of cloud computing? Was this article helpful? Let us know in the comments below! \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","user":{"name":"Hunter Johnson","username":"huntereducative","twitter_username":null,"github_username":"HunterErnestJohnson","user_id":850332,"website_url":"http://www.educative.io","profile_image":"https://res.cloudinary.com/practicaldev/image/fetch/s--8KglxJXS--/c_fill,f_auto,fl_progressive,h_640,q_auto,w_640/https://dev-to-uploads.s3.amazonaws.com/uploads/user/profile_image/850332/f5ef19ed-024a-4882-b79c-02b1e12f4258.jpg","profile_image_90":"https://res.cloudinary.com/practicaldev/image/fetch/s--D6jOaZN2--/c_fill,f_auto,fl_progressive,h_90,q_auto,w_90/https://dev-to-uploads.s3.amazonaws.com/uploads/user/profile_image/850332/f5ef19ed-024a-4882-b79c-02b1e12f4258.jpg"},"organization":{"name":"Educative","username":"educative","slug":"educative","profile_image":"https://res.cloudinary.com/practicaldev/image/fetch/s--1HidfbcU--/c_fill,f_auto,fl_progressive,h_640,q_auto,w_640/https://dev-to-uploads.s3.amazonaws.com/uploads/organization/profile_image/1212/1c8e5702-1b23-4184-9fde-803486a1d61c.png","profile_image_90":"https://res.cloudinary.com/practicaldev/image/fetch/s--CKA2H5f8--/c_fill,f_auto,fl_progressive,h_90,q_auto,w_90/https://dev-to-uploads.s3.amazonaws.com/uploads/organization/profile_image/1212/1c8e5702-1b23-4184-9fde-803486a1d61c.png"}}