{"type_of":"article","id":1243417,"title":"Basic Concepts of Data Analytics","description":"Introduction:   In this article we'll be looking at the different concept behind data...","readable_publish_date":"Nov 4","slug":"basic-concepts-of-data-analytics-5ej3","path":"/liaqat_yusra/basic-concepts-of-data-analytics-5ej3","url":"https://dev.to/liaqat_yusra/basic-concepts-of-data-analytics-5ej3","comments_count":0,"public_reactions_count":3,"collection_id":null,"published_timestamp":"2022-11-04T16:21:59Z","positive_reactions_count":3,"cover_image":"https://res.cloudinary.com/practicaldev/image/fetch/s--elO0Jqk4--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/9muqzqt9i1rjivmrhf78.png","social_image":"https://res.cloudinary.com/practicaldev/image/fetch/s--7UR7HydW--/c_imagga_scale,f_auto,fl_progressive,h_500,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/9muqzqt9i1rjivmrhf78.png","canonical_url":"https://dev.to/liaqat_yusra/basic-concepts-of-data-analytics-5ej3","created_at":"2022-11-04T14:35:01Z","edited_at":"2022-11-04T17:35:35Z","crossposted_at":null,"published_at":"2022-11-04T16:21:59Z","last_comment_at":"2022-11-04T16:21:59Z","reading_time_minutes":8,"tag_list":"dataanalyticconcept, aws, bigdataservices, beginners","tags":["dataanalyticconcept","aws","bigdataservices","beginners"],"body_html":"<h3>\n  <a name=\"introduction\" href=\"#introduction\">\n  </a>\n  Introduction:\n</h3>\n\n<p>In this article we'll be looking at the different concept behind data analytics. It will provide you with the clearer understanding of what data analytics and how it allow you to collect, store, review and analyze data to help derive business decisions through <strong>insights that have been identified.</strong></p>\n\n<p><strong>Who should read this article?</strong><br>\nThis article is written to provide you the foundation to data analytics and is ideal for those looking to become data analyst or data scientist</p>\n\n<h3>\n  <a name=\"objectives\" href=\"#objectives\">\n  </a>\n  Objectives:\n</h3>\n\n<ul>\n<li>The objectives of this course is to provide you with the understanding of different analytics concepts.</li>\n<li>Data types: including structured, semi structured and unstructured data </li>\n<li>When you should use data analytics within your business</li>\n<li>The process behind running analytics against data</li>\n</ul>\n\n<h3>\n  <a name=\"introduction-to-data-analytics\" href=\"#introduction-to-data-analytics\">\n  </a>\n  Introduction to Data Analytics:\n</h3>\n\n<p>In this article, I'll provide you with a basic understanding of different concepts to help you understand the concept behind many of the AWS services and architectures used to implement data analysis.</p>\n\n<p>Simply speaking, analytics or data analytics is the science of data transformation, transforming data into meaningful information and insights. <br>\nHere we refer data as any input you have like a spreadsheet, a CSV file, historic sales information, a database, raw research data, essentially any data that you may have.</p>\n\n<p><a href=\"https://res.cloudinary.com/practicaldev/image/fetch/s--j7xdfSa0--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qnm1jbi8puakt3wtjhtu.png\" class=\"article-body-image-wrapper\"><img src=\"https://res.cloudinary.com/practicaldev/image/fetch/s--j7xdfSa0--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qnm1jbi8puakt3wtjhtu.png\" alt=\"Image description\" loading=\"lazy\" width=\"770\" height=\"323\"></a></p>\n\n<p>With this basic concepts I mind let’s explore a bit more about data analytics concepts.</p>\n\n<p><strong>Starts with a question:</strong><br>\nEverything start with the question to the problem we have, using analytics we want to solve these problems by selecting the right tools to collect or clean the data in an appropriate fashion.</p>\n\n<h3>\n  <a name=\"types-of-data\" href=\"#types-of-data\">\n  </a>\n  Types of data:\n</h3>\n\n<p>As an input for our analytics, we may have data which can be organized into different categories. For example,</p>\n\n<ul>\n<li>Qualitative data</li>\n<li>Quantitative data</li>\n<li>Structured data</li>\n<li>Semi structured data</li>\n<li>Un structured data</li>\n</ul>\n\n<p>If you are new to these concepts and you don’t hear these terms before then don’t worry ill be explaining next in my article.<br>\nIn this article we will understand which AWS services can be used in the analytics process.</p>\n\n<h3>\n  <a name=\"data-types\" href=\"#data-types\">\n  </a>\n  Data types:\n</h3>\n\n<p>Here let’s take a little bit about the input. We have two basics data types where the data is organized</p>\n\n<p><strong>Quantitative Data:</strong><br>\nQuantitative refers to numbers, the amount of certain values, like the number of citizen in a given geographical area.<br>\n<em>Example:</em> no. of students in class = 16<br>\nBoys= 8<br>\nGirls= 8</p>\n\n<p><strong>Qualitative data:</strong><br>\nQualitative data refers to attributes of the population not expressed in direct numbers but to qualify their attributes like,</p>\n\n<ul>\n<li>Eye color</li>\n<li>Satisfaction level</li>\n</ul>\n\n<h3>\n  <a name=\"main-data-types\" href=\"#main-data-types\">\n  </a>\n  Main data types:\n</h3>\n\n<p>We also have three main classifications for the data formats which are following</p>\n\n<p><strong>Structured data:</strong><br>\nStructured data referred to data with a defined data model like SQL databases, where tables have a fixed DB model and schema. On AWS for example, the RDS or Rational databases services is a complete example of a structured store.</p>\n\n<p><a href=\"https://res.cloudinary.com/practicaldev/image/fetch/s--fouqzsLe--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ufsdmvzy77ph15ikxu57.png\" class=\"article-body-image-wrapper\"><img src=\"https://res.cloudinary.com/practicaldev/image/fetch/s--fouqzsLe--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ufsdmvzy77ph15ikxu57.png\" alt=\"Image description\" loading=\"lazy\" width=\"550\" height=\"261\"></a></p>\n\n<p><strong>Semi- structured data:</strong><br>\nIn semi structured data we basically have a flexible data model or tagging mechanism that allows a semantic organization and some kind of hierarchy discovery from the data without having the fixed and rigid rules from SQL database. Non- SQL databases can also be structured but usually they are used in flexible way to complement the limitations from Amazon S3 to SQL databases. Amazon DynamoDB allows each record to have a different numbers of columns but gives fixed indexes for searching. This provides a very flexible schema <br>\nEg. Non-sql, XML, JSON and CSV files are good examples of semi-structured data.</p>\n\n<p><a href=\"https://res.cloudinary.com/practicaldev/image/fetch/s--GRudjFnl--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rmaspl6rtn8zttg30w89.png\" class=\"article-body-image-wrapper\"><img src=\"https://res.cloudinary.com/practicaldev/image/fetch/s--GRudjFnl--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rmaspl6rtn8zttg30w89.png\" alt=\"Image description\" loading=\"lazy\" width=\"798\" height=\"449\"></a></p>\n\n<p><strong>Unstructured data:</strong><br>\nAnd lastly, we have the un structured data where all kind of text information without a data model is classified. Here we have all kind of documents without a proper data model or a schema like;<br>\nBooks, natural language processing and all sorts of text processing.</p>\n\n<p><a href=\"https://res.cloudinary.com/practicaldev/image/fetch/s--SSE4mW6b--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/jx7yl6rfr374d84zf5pk.png\" class=\"article-body-image-wrapper\"><img src=\"https://res.cloudinary.com/practicaldev/image/fetch/s--SSE4mW6b--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/jx7yl6rfr374d84zf5pk.png\" alt=\"Image description\" loading=\"lazy\" width=\"724\" height=\"407\"></a><br>\nData generation has exploded exponentially in the past decade. We generate data from the moment we wake up to the moment we go to bed or even while sleeping, sensors can be collecting data from our body and environment to improve a series of apps and services. It could be suggested that we are generating too much data much more than we can probably analyze.</p>\n\n<p><a href=\"https://res.cloudinary.com/practicaldev/image/fetch/s--S9z_Jauh--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/f66kvq3qhxnjgxy15h3r.png\" class=\"article-body-image-wrapper\"><img src=\"https://res.cloudinary.com/practicaldev/image/fetch/s--S9z_Jauh--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/f66kvq3qhxnjgxy15h3r.png\" alt=\"Image description\" loading=\"lazy\" width=\"664\" height=\"373\"></a><br>\n<strong>When to use data analytics:</strong><br>\nTo help us define if we need to use data analytics services to find the answers of our problems that are locked within our data. We can look at the different factors<br>\n<strong>Volume:</strong> the first is the volume which refers to the size of the data set or as we usually call it the data size. And size matters in order to decide the right tool to analyze it. Usually, a big data problem will go into scale from gigabits to petabytes of data.</p>\n\n<p><a href=\"https://res.cloudinary.com/practicaldev/image/fetch/s--Fal-z1or--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ypu2jbew7kpugyor96pj.png\" class=\"article-body-image-wrapper\"><img src=\"https://res.cloudinary.com/practicaldev/image/fetch/s--Fal-z1or--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ypu2jbew7kpugyor96pj.png\" alt=\"Image description\" loading=\"lazy\" width=\"674\" height=\"379\"></a><br>\n<strong>Velocity:</strong> There is also what we call the velocity of the data, which indicates how quickly you need to get your answers and is also related to the age of the data. For example, historical records from previous years or real-time alerting and information. This has a great impact on the tools used to analyze the data because, depending on the response time you need, are you comfortable with real-time responses or waiting? By knowing this, we can choose the right tool and technique.<br>\n<strong>Variety:</strong> this refers to the variety of the source data classification; if its structured or unstructured. As often analytic problems will have sources from several types like.</p>\n\n<p>Business intelligence platform data, blogs, CSV data, texts and any sorts of structured or unstructured data. </p>\n\n<h3>\n  <a name=\"analytics-types\" href=\"#analytics-types\">\n  </a>\n  ANALYTICS TYPES:\n</h3>\n\n<p>The power of analytics grows when we move from batch analytics to real-time   analytics and then to predictive analytics, but as always the problem you are trying to resolve will always dictate the best method. </p>\n\n<p>*<em>Batch analytics: *</em>  In reporting or BI analysis, data is processed to a job and the results are presented after a period of time. We have years of data in your data warehouse or in log files, in spreadsheets, and we want to find interesting patterns in this data such as potential sales, potential profits, or potential insights from research data.</p>\n\n<p><strong>Real-time analytics:</strong> When it comes to real-time analytics, we need to get the answers as soon as possible. If you lose time, there can be serious consequences like fast response to security alerts from intrusion detection systems or responses to advertising campaigns.</p>\n\n<p><strong>Predictive analytics:</strong> The last type of data analytics is predictive analytics, which take historical data as an input, it then learn from the history and then leaves us predictions for future behaviors. This is a common case for machine learning like spam detection where based on past behavior we identify malicious messages, predicting and avoiding spam messages. </p>\n\n<p><a href=\"https://res.cloudinary.com/practicaldev/image/fetch/s--2vpzegJm--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vryu0ea1gw5ypz1t4p4r.png\" class=\"article-body-image-wrapper\"><img src=\"https://res.cloudinary.com/practicaldev/image/fetch/s--2vpzegJm--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vryu0ea1gw5ypz1t4p4r.png\" alt=\"Image description\" loading=\"lazy\" width=\"773\" height=\"435\"></a></p>\n\n<h3>\n  <a name=\"data-analytic-process\" href=\"#data-analytic-process\">\n  </a>\n  Data analytic process:\n</h3>\n\n<p>First of all, when you have a problem you usually define it as a question to start your journey into the analytics field. With your question ready, you need the source data which is effectively your starting point. This can be a data warehouse database, rational database tables or a NoSQL store, a csv file, books, text files. In short, every readable format can be used as an input. Selecting the input will depend on the answers you are trying to return from your problem or question.</p>\n\n<p><strong>For example:</strong><br>\nThe problem might be to count words in book from Shakespeare or on the other end of the scale, the problem might be to analyze DNA to find patterns.  So the type of problem will dictate the data and also the processing algorithm.</p>\n\n<p>With your input ready, you need to store it in an accessible place for the tools to then process it, analyze and return the results. The separation using process and analysis is based on the fact that some analytics solutions from AWS will require a previous cleaning or pre-processing from the data for better results and accuracy.</p>\n\n<p>AWS has structured its portfolio around the collect, store, analyze and visualize the methodology for each step which integrated services to perform each function.</p>\n\n<p><a href=\"https://res.cloudinary.com/practicaldev/image/fetch/s--84zqVdsM--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/9dxnyns07a3orcpfixc9.png\" class=\"article-body-image-wrapper\"><img src=\"https://res.cloudinary.com/practicaldev/image/fetch/s--84zqVdsM--/c_limit%2Cf_auto%2Cfl_progressive%2Cq_auto%2Cw_880/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/9dxnyns07a3orcpfixc9.png\" alt=\"Image description\" loading=\"lazy\" width=\"736\" height=\"414\"></a></p>\n\n<p><strong>Collect/ingest:</strong></p>\n\n<p>The first step in your analytics process is to collect the data that you want to use as an input. The data collection is also called ingestion which is the act of acquiring data and storing it for later usage. In the data collection, we have different type of ingested data. We can have transactional data which is represented by traditional rational databases, reads and writes. We can  also have file ingestion reading data from file sources such as like logs, texts, CSV files, book contents and so on and you can have also stream data represented by any kind of  streamed content like a clickstream and events on a website, internet of things devices and so on.<br>\nThe toolset AWS currently offers can ingest data from many different sources. For example; with kinesis streams or firehose we can work easily with streamed data on any source even if they are on-premises.<br>\n<strong>Store:</strong></p>\n\n<p>After the data is generated or acquired, we need to store it in an accessible place for AWS. This is usually called a data lake. The big pool where your services go to get the source and to deliver back the results. Amazon S3 is one of the core storage services from AWS. As a highly durable object store integrated seamlessly with all other AWS analytic services for data loading ad store. You can also have data on Amazon RDS if the data has structured format or a Redshift. If it has no fixed data model but a basic structure, we can use DynamoDB, the NoSQL solution from AWS TO STORE IT. And if your data has very infrequent access we can use glacier, the archive service from AWS.</p>\n\n<p><strong>Analyze/process:</strong></p>\n\n<ul>\n<li>Batch</li>\n<li>Real-time</li>\n<li>Predictive\nRemember the right service or tool depends on the type of problem you have and the velocity of your replies. If you can wait for a while or if you need real-time answers to the problems and if you want to predict future behaviors.\n<strong>Amazon EMR</strong>\n</li>\n</ul>\n\n<p>If your goal is to provide reports based on </p>\n\n<ul>\n<li>Batch processing,</li>\n<li> Historical data Analysis</li>\n<li> Identifying patterns on large data sets</li>\n</ul>\n\n<p>If you need real-time replies for questions or the results must be displayed on live dashboards, then you might take advantage of stream-based processing with amazon Kinesis, AWS Lambda or Amazon OpenSearch. Kinesis provides streams to load, store and easily consume live stream data and AWS Lambda can protect to theses streams events, executing functions you define.</p>\n\n<p>For predictive analytics where you need to forecast an event based on historical cases, you might take advantage of Amazon Machine Learning services to build highly available predicting applications. Not forgetting data pipeline which can be used orchestrate all these services. As a frame work for data-driven workflows, data pipeline can be used to automate your database loads and for the visualization aspect to get a nice overview or dashboard from you replies you can use Amazon QuickSight which allows you to create rich visualization from your data.</p>\n\n<h3>\n  <a name=\"conclusion\" href=\"#conclusion\">\n  </a>\n  conclusion:\n</h3>\n\n<p>That brings end to this introductory article and now you should have a greater understanding of the Basic concepts behind Data Analytics.<br>\nWe have covered all the basic concepts of Data Analytics in this article. Thanks for taking the time to read this article. I hope you found it interesting and informative. I hope you understand what is Data Analytics, Analytics types, When you should use data analytics within your business? and The process behind running analytics against data. I hope you enjoy reading this article.</p>\n\n<p>Please share your feedback with us as well.<br>\nThank YOU!!</p>\n\n","body_markdown":"###Introduction:\nIn this article we'll be looking at the different concept behind data analytics. It will provide you with the clearer understanding of what data analytics and how it allow you to collect, store, review and analyze data to help derive business decisions through **insights that have been identified.**\n\n**Who should read this article?**\nThis article is written to provide you the foundation to data analytics and is ideal for those looking to become data analyst or data scientist\n\n###Objectives:\n\n- The objectives of this course is to provide you with the understanding of different analytics concepts.\n- Data types: including structured, semi structured and unstructured data \n- When you should use data analytics within your business\n- The process behind running analytics against data\n\n###Introduction to Data Analytics:\nIn this article, I'll provide you with a basic understanding of different concepts to help you understand the concept behind many of the AWS services and architectures used to implement data analysis.\n\nSimply speaking, analytics or data analytics is the science of data transformation, transforming data into meaningful information and insights. \nHere we refer data as any input you have like a spreadsheet, a CSV file, historic sales information, a database, raw research data, essentially any data that you may have.\n\n\n![Image description](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/qnm1jbi8puakt3wtjhtu.png)\n\nWith this basic concepts I mind let’s explore a bit more about data analytics concepts.\n\n**Starts with a question:**\nEverything start with the question to the problem we have, using analytics we want to solve these problems by selecting the right tools to collect or clean the data in an appropriate fashion.\n\n###Types of data:\nAs an input for our analytics, we may have data which can be organized into different categories. For example,\n\n- Qualitative data\n- Quantitative data\n- Structured data\n- Semi structured data\n- Un structured data\n\n If you are new to these concepts and you don’t hear these terms before then don’t worry ill be explaining next in my article.\nIn this article we will understand which AWS services can be used in the analytics process.\n\n### Data types:\nHere let’s take a little bit about the input. We have two basics data types where the data is organized\n\n**Quantitative Data:**\nQuantitative refers to numbers, the amount of certain values, like the number of citizen in a given geographical area.\n_Example:_ no. of students in class = 16\nBoys= 8\nGirls= 8\n\n**Qualitative data:**\nQualitative data refers to attributes of the population not expressed in direct numbers but to qualify their attributes like,\n\n- Eye color\n- Satisfaction level\n\n###Main data types:\nWe also have three main classifications for the data formats which are following\n\n**Structured data:**\nStructured data referred to data with a defined data model like SQL databases, where tables have a fixed DB model and schema. On AWS for example, the RDS or Rational databases services is a complete example of a structured store.\n\n![Image description](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ufsdmvzy77ph15ikxu57.png)\n\n**Semi- structured data:**\nIn semi structured data we basically have a flexible data model or tagging mechanism that allows a semantic organization and some kind of hierarchy discovery from the data without having the fixed and rigid rules from SQL database. Non- SQL databases can also be structured but usually they are used in flexible way to complement the limitations from Amazon S3 to SQL databases. Amazon DynamoDB allows each record to have a different numbers of columns but gives fixed indexes for searching. This provides a very flexible schema \nEg. Non-sql, XML, JSON and CSV files are good examples of semi-structured data.\n\n\n![Image description](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/rmaspl6rtn8zttg30w89.png)\n\n**Unstructured data:**\nAnd lastly, we have the un structured data where all kind of text information without a data model is classified. Here we have all kind of documents without a proper data model or a schema like;\nBooks, natural language processing and all sorts of text processing.\n\n\n![Image description](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/jx7yl6rfr374d84zf5pk.png)\nData generation has exploded exponentially in the past decade. We generate data from the moment we wake up to the moment we go to bed or even while sleeping, sensors can be collecting data from our body and environment to improve a series of apps and services. It could be suggested that we are generating too much data much more than we can probably analyze.\n\n![Image description](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/f66kvq3qhxnjgxy15h3r.png)\n**When to use data analytics:**\nTo help us define if we need to use data analytics services to find the answers of our problems that are locked within our data. We can look at the different factors\n**Volume:** the first is the volume which refers to the size of the data set or as we usually call it the data size. And size matters in order to decide the right tool to analyze it. Usually, a big data problem will go into scale from gigabits to petabytes of data.\n\n\n![Image description](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/ypu2jbew7kpugyor96pj.png)\n**Velocity:** There is also what we call the velocity of the data, which indicates how quickly you need to get your answers and is also related to the age of the data. For example, historical records from previous years or real-time alerting and information. This has a great impact on the tools used to analyze the data because, depending on the response time you need, are you comfortable with real-time responses or waiting? By knowing this, we can choose the right tool and technique.\n**Variety:** this refers to the variety of the source data classification; if its structured or unstructured. As often analytic problems will have sources from several types like.\n \nBusiness intelligence platform data, blogs, CSV data, texts and any sorts of structured or unstructured data. \n\n###ANALYTICS TYPES:\nThe power of analytics grows when we move from batch analytics to real-time   analytics and then to predictive analytics, but as always the problem you are trying to resolve will always dictate the best method. \n\n**Batch analytics: **  In reporting or BI analysis, data is processed to a job and the results are presented after a period of time. We have years of data in your data warehouse or in log files, in spreadsheets, and we want to find interesting patterns in this data such as potential sales, potential profits, or potential insights from research data.\n\n**Real-time analytics:** When it comes to real-time analytics, we need to get the answers as soon as possible. If you lose time, there can be serious consequences like fast response to security alerts from intrusion detection systems or responses to advertising campaigns.\n\n**Predictive analytics:** The last type of data analytics is predictive analytics, which take historical data as an input, it then learn from the history and then leaves us predictions for future behaviors. This is a common case for machine learning like spam detection where based on past behavior we identify malicious messages, predicting and avoiding spam messages. \n\n![Image description](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/vryu0ea1gw5ypz1t4p4r.png)\n\n###Data analytic process:\nFirst of all, when you have a problem you usually define it as a question to start your journey into the analytics field. With your question ready, you need the source data which is effectively your starting point. This can be a data warehouse database, rational database tables or a NoSQL store, a csv file, books, text files. In short, every readable format can be used as an input. Selecting the input will depend on the answers you are trying to return from your problem or question.\n\n**For example:**\nThe problem might be to count words in book from Shakespeare or on the other end of the scale, the problem might be to analyze DNA to find patterns.  So the type of problem will dictate the data and also the processing algorithm.\n\nWith your input ready, you need to store it in an accessible place for the tools to then process it, analyze and return the results. The separation using process and analysis is based on the fact that some analytics solutions from AWS will require a previous cleaning or pre-processing from the data for better results and accuracy.\n\nAWS has structured its portfolio around the collect, store, analyze and visualize the methodology for each step which integrated services to perform each function.\n\n\n![Image description](https://dev-to-uploads.s3.amazonaws.com/uploads/articles/9dxnyns07a3orcpfixc9.png)\n\n**Collect/ingest:**\n\nThe first step in your analytics process is to collect the data that you want to use as an input. The data collection is also called ingestion which is the act of acquiring data and storing it for later usage. In the data collection, we have different type of ingested data. We can have transactional data which is represented by traditional rational databases, reads and writes. We can  also have file ingestion reading data from file sources such as like logs, texts, CSV files, book contents and so on and you can have also stream data represented by any kind of  streamed content like a clickstream and events on a website, internet of things devices and so on.\nThe toolset AWS currently offers can ingest data from many different sources. For example; with kinesis streams or firehose we can work easily with streamed data on any source even if they are on-premises.\n**Store:**\n\nAfter the data is generated or acquired, we need to store it in an accessible place for AWS. This is usually called a data lake. The big pool where your services go to get the source and to deliver back the results. Amazon S3 is one of the core storage services from AWS. As a highly durable object store integrated seamlessly with all other AWS analytic services for data loading ad store. You can also have data on Amazon RDS if the data has structured format or a Redshift. If it has no fixed data model but a basic structure, we can use DynamoDB, the NoSQL solution from AWS TO STORE IT. And if your data has very infrequent access we can use glacier, the archive service from AWS.\n\n**Analyze/process:**\n\n- Batch\n- Real-time\n- Predictive\nRemember the right service or tool depends on the type of problem you have and the velocity of your replies. If you can wait for a while or if you need real-time answers to the problems and if you want to predict future behaviors.\n**Amazon EMR**\n\n If your goal is to provide reports based on \n\n- Batch processing,\n-  Historical data Analysis\n-  Identifying patterns on large data sets\n\nIf you need real-time replies for questions or the results must be displayed on live dashboards, then you might take advantage of stream-based processing with amazon Kinesis, AWS Lambda or Amazon OpenSearch. Kinesis provides streams to load, store and easily consume live stream data and AWS Lambda can protect to theses streams events, executing functions you define.\n\nFor predictive analytics where you need to forecast an event based on historical cases, you might take advantage of Amazon Machine Learning services to build highly available predicting applications. Not forgetting data pipeline which can be used orchestrate all these services. As a frame work for data-driven workflows, data pipeline can be used to automate your database loads and for the visualization aspect to get a nice overview or dashboard from you replies you can use Amazon QuickSight which allows you to create rich visualization from your data.\n\n###conclusion:\nThat brings end to this introductory article and now you should have a greater understanding of the Basic concepts behind Data Analytics.\nWe have covered all the basic concepts of Data Analytics in this article. Thanks for taking the time to read this article. I hope you found it interesting and informative. I hope you understand what is Data Analytics, Analytics types, When you should use data analytics within your business? and The process behind running analytics against data. I hope you enjoy reading this article.\n\nPlease share your feedback with us as well.\nThank YOU!!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","user":{"name":"Yusra Liaqat","username":"liaqat_yusra","twitter_username":"liaqat_yusra","github_username":null,"user_id":921722,"website_url":null,"profile_image":"https://res.cloudinary.com/practicaldev/image/fetch/s--rRrzvCkq--/c_fill,f_auto,fl_progressive,h_640,q_auto,w_640/https://dev-to-uploads.s3.amazonaws.com/uploads/user/profile_image/921722/2e7f04a6-bc83-4d76-a1f2-8cafcfbcf041.jpg","profile_image_90":"https://res.cloudinary.com/practicaldev/image/fetch/s--3ieI0Qjn--/c_fill,f_auto,fl_progressive,h_90,q_auto,w_90/https://dev-to-uploads.s3.amazonaws.com/uploads/user/profile_image/921722/2e7f04a6-bc83-4d76-a1f2-8cafcfbcf041.jpg"}}